//=============================================================================
//
// ボス背景の処理 [BossBG.h]
// Author:Taiki Hayasaka
//
//=============================================================================
#ifndef _BOSSBG_H_
#define _BOSSBG_H_

#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
HRESULT InitBossBG(void);
void UninitBossBG(void);
void UpdateBossBG(void);
void DrawBossBG(void);

#endif
