//=============================================================================
//
// エフェクトの処理 [effect.h]
// Author:Taiki Hayasaka
//
//=============================================================================
#ifndef _EFFECT_H_
#define _EFFECT_H_

#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
HRESULT InitEffect(void);
void UninitEffect(void);
void UpdateEffect(void);
void DrawEffect(void);
void SetEffect(D3DXVECTOR3 pos, D3DXCOLOR col);

//=============================================================================
// エフェクトの構造体
//=============================================================================
typedef struct
{
	D3DXVECTOR3 pos;	//エフェクトの位置
	D3DXCOLOR col;		//エフェクトの色
	bool bUse;			//使用しているかどうか
}EFFECT;

#endif