//=============================================================================
//
// メイン処理 [main.h]
// Author : Taiki Hayasaka
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#define DIRECTINPUT_VERSION (0x0800)

#include <windows.h>

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "dinput.h"					// 入力処理に必要
#include "d3dx9.h"					// 描画処理に必要
#include "xaudio2.h"				// サウンド再生に必要

//=============================================================================
// ライブラリファイルのリンク
//=============================================================================
#pragma comment(lib, "d3d9.lib")	// 描画処理に必要
#pragma comment(lib, "d3dx9.lib")	// 拡張ライブラリ
#pragma comment(lib, "dxguid.lib")	// コンポーネント使用に必要
#pragma comment(lib, "dinput8.lib")	// 入力処理に必要
#pragma comment(lib, "winmm.lib")

//=============================================================================
// マクロ定義
//=============================================================================
#define SCREEN_WIDTH (1280)					// 画面の幅
#define SCREEN_HEIGHT (720)					// 画面の高さ
#define WIDTH_HALF	(SCREEN_WIDTH/2)
#define HEIGHT_HALF	(SCREEN_HEIGHT/2)	

#define CENTER_POS	(D3DXVECTOR3(WIDTH_HALF,HEIGHT_HALF,0.0f))

#define FVF_VERTEX_2D (D3DFVF_XYZRHW|D3DFVF_DIFFUSE|D3DFVF_TEX1) // 頂点フォーマット

#define NUM_VERTEX (4)				// 頂点数
#define NUM_POLYGON (2)				// ポリゴン数
#define MAX_DATA (256)				// 敵の数

//=============================================================================
// 前方宣言
//=============================================================================
class CScene;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
int GetFPS(void);

#endif
