//=============================================================================
//
// スコアの処理[score.cpp]
// Author : taiki hayasaka
//
//=============================================================================
#include "score.h"

//=============================================================================
// 静的メンバ変数
//=============================================================================
int CScore::m_nScore = NULL;
CNumber *CScore::m_apNumber[MAX_NUMBER] = {};

//=============================================================================
// コンストラクタ
//=============================================================================
CScore::CScore(PRIORITY nPriority) :CScene(nPriority)
{
	// 初期化
	int nScore = 0;
}

//=============================================================================
// デストラクタ
//=============================================================================
CScore::~CScore()
{

}

//=============================================================================
// 生成処理
//=============================================================================
CScore *CScore::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	CScore *pScore = NULL;

	if (pScore == NULL)
	{
		// 動的確保
		pScore = new CScore;

		if (pScore != NULL)
		{
			// 初期化処理を呼び出す
			pScore->Init(pos, size);
		}
	}
	
	return pScore;
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CScore::Init(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	for (int nCntNumber = 0; nCntNumber < 8; nCntNumber++)
	{
		m_apNumber[nCntNumber] = CNumber::Create(D3DXVECTOR3(pos.x + (nCntNumber * (size.x + 15)), pos.y, 0.0f),size);
	}

	m_nScore = 0;

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CScore::Uninit(void)
{
	for (int nCntNumber = 0; nCntNumber < 8; nCntNumber++)
	{
		if (m_apNumber[nCntNumber] != NULL)
		{
			m_apNumber[nCntNumber]->Uninit();

			delete m_apNumber[nCntNumber];
		}
	}

	Release();
}

//=============================================================================
// 更新処理
//=============================================================================
void CScore::Update(void)
{

}

//=============================================================================
// 描画処理
//=============================================================================
void CScore::Draw(void)
{
	for (int nCntNumber = 0; nCntNumber < 8; nCntNumber++)
	{
		if (m_apNumber[nCntNumber] != NULL)
		{
			m_apNumber[nCntNumber]->Draw();
		}
	}
}

//=============================================================================
// セットスコア
//=============================================================================
void CScore::SetScore(int nScore)
{
	int aNumber[MAX_NUMBER];

	m_nScore = nScore;

	for (int nCntScore = 0; nCntScore < MAX_NUMBER; nCntScore++)
	{
		aNumber[nCntScore] = m_nScore / (int)powf(10.0f, 8.0f - (nCntScore + 1.0f));

		m_apNumber[nCntScore]->SetNumber(aNumber[nCntScore]);
	}
}

//=============================================================================
// スコア加算
//=============================================================================
void CScore::AddScore(int nValue)
{
	m_nScore += nValue;

	SetScore(m_nScore);
}

//=============================================================================
// スコアの取得
//=============================================================================
int CScore::GetScore(void)
{
	return m_nScore;
}
